Service - Income Tax/archive/2020/sample messages/file_request_ir6_standalone.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <add:Action xmlns:add="http://www.w3.org/2005/08/addressing">https://services.ird.govt.nz/GWS/Returns/Return/File</add:Action>
    </soap:Header>
    <soap:Body>
        <ret:File xmlns:ret="https://services.ird.govt.nz/GWS/Returns/">
            <ret:ReturnFileRequestMsg>
                <fil:FileRequestWrapper xmlns:fil="https://services.ird.govt.nz/GWS/Returns/:types/FileRequest">
                    <r6:fileRequest xmlns:r6="urn:www.ird.govt.nz/GWS:types/ReturnIR6.v1" xmlns:rc="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v2">
                        <rc:fileHeader xmlns:cmn="urn:www.ird.govt.nz/GWS:types/Common.v2">
                            <cmn:softwareProviderData>
                                <cmn:softwareProvider>SoftwareProvider</cmn:softwareProvider>
                                <cmn:softwarePlatform>SoftwarePlatform</cmn:softwarePlatform>
                                <cmn:softwareRelease>1</cmn:softwareRelease>
                            </cmn:softwareProviderData>
                            <cmn:identifier IdentifierValueType="IRD">079945793</cmn:identifier>
                            <cmn:accountType>INC</cmn:accountType>
                            <rc:periodEndDate>2019-03-31</rc:periodEndDate>
                            <rc:majorFormType>INC</rc:majorFormType>
                            <rc:minorFormType>6</rc:minorFormType>
                        </rc:fileHeader>
                        <rc:fileBody>
                            <rc:standardFields>
                                <rc:isNilReturn>false</rc:isNilReturn>
                                <rc:isFinalReturn>false</rc:isFinalReturn>
                                <rc:amendmentRequest>
                                    <rc:isAmended>false</rc:isAmended>
                                    <rc:amendReason/>
                                    <rc:amendDetails/>
                                </rc:amendmentRequest>
                            </rc:standardFields>
                            <rc:formFields xsi:type="r6:FormFieldsType" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ic="urn:www.ird.govt.nz/GWS:types/IncomeReturnCommon.v1">
                                <r6:firstReturnEstateTrustStartDate>2018-05-28</r6:firstReturnEstateTrustStartDate>
                                <r6:estateTrustType>N</r6:estateTrustType>
                                <r6:interestIncome>
                                    <ic:totalTaxPaid>0</ic:totalTaxPaid>
                                    <ic:totalIncome>0</ic:totalIncome>
                                </r6:interestIncome>
                                <r6:dividendIncome>
                                    <ic:totalImputationCredits>0</ic:totalImputationCredits>
                                    <ic:totalRWTCredits>1000.00</ic:totalRWTCredits>
                                    <ic:totalGrossDividends>4000.00</ic:totalGrossDividends>
                                </r6:dividendIncome>
                                <r6:maoriAuthorityDistributions>
                                    <ic:totalMACredits>1000.00</ic:totalMACredits>
                                    <ic:totalMADistributions>1000.00</ic:totalMADistributions>
                                </r6:maoriAuthorityDistributions>
                                <r6:partnershipEstateTrustIncome>
                                    <ic:totalTaxCredits>6000.00</ic:totalTaxCredits>
                                    <ic:totalIncome>1000.00</ic:totalIncome>
                                </r6:partnershipEstateTrustIncome>
                                <r6:overseasIncome>
                                    <ic:totalTaxPaid>0</ic:totalTaxPaid>
                                    <ic:totalIncome>1000</ic:totalIncome>
                                </r6:overseasIncome>
                                <r6:pieIncome>
                                    <ic:totalTaxCredits>1000.00</ic:totalTaxCredits>
                                    <ic:totalIncome>1000.00</ic:totalIncome>
                                </r6:pieIncome>
                                <r6:ltcIncome>
                                    <ic:totalTaxCredits>1000.00</ic:totalTaxCredits>
                                    <ic:totalIncome>1000.00</ic:totalIncome>
                                </r6:ltcIncome>
                                <r6:ltcNonAllowableDeductions>0</r6:ltcNonAllowableDeductions>
                                <r6:ltcPriorYearNonAllowableDeductionsClaimed>0</r6:ltcPriorYearNonAllowableDeductionsClaimed>
                                <r6:ltcAdjustedIncome>1000.00</r6:ltcAdjustedIncome>
                                <r6:businessOrRentalIncome>1000.00</r6:businessOrRentalIncome>
                                <r6:otherIncome>
                                    <ic:totalTaxCredits>1000.00</ic:totalTaxCredits>
                                    <ic:totalIncome>1000.00</ic:totalIncome>
                                </r6:otherIncome>
                                <r6:saleOfProperty>1000.00</r6:saleOfProperty>
                                <r6:rlwtCredit>0</r6:rlwtCredit>
                                <r6:totalTaxCredits>11000.00</r6:totalTaxCredits>
                                <r6:beneficiaryIncome>0</r6:beneficiaryIncome>
                                <r6:trusteeIncome>12000.00</r6:trusteeIncome>
                                <r6:totalExpensesClaimed>0</r6:totalExpensesClaimed>
                                <r6:lossesBroughtForward>0</r6:lossesBroughtForward>
                                <r6:lossesClaimedThisYear>0</r6:lossesClaimedThisYear>
                                <r6:totalDistributions>1000.00</r6:totalDistributions>
                                <r6:totalTaxableDistributions>1000.00</r6:totalTaxableDistributions>
                                <r6:disclosureRequiredCFCorFIF>false</r6:disclosureRequiredCFCorFIF>
                                <r6:totalBeneficiaryTax>0</r6:totalBeneficiaryTax>
                                <r6:totalTrusteeIncome>12000</r6:totalTrusteeIncome>
                                <r6:taxOnTrusteeIncome>3960.00</r6:taxOnTrusteeIncome>
                                <r6:trusteeShareOfOverseasTaxPaid>0</r6:trusteeShareOfOverseasTaxPaid>
                                <r6:trusteeShareOfDivImpCredits>0</r6:trusteeShareOfDivImpCredits>
                                <r6:trusteeShareOfTaxCredits>11000.00</r6:trusteeShareOfTaxCredits>
                                <r6:taxOnTrusteeIncomeLessCredits>-7040.00</r6:taxOnTrusteeIncomeLessCredits>
                                <r6:residualIncomeTax>-7040.00</r6:residualIncomeTax>
                                <r6:provisionalTax>
                                    <ic:provisionalTaxOption>EST</ic:provisionalTaxOption>
                                    <ic:provisionalTaxPayable>1000</ic:provisionalTaxPayable>
                                    <ic:provisionalTaxStartDate>2019-01-01</ic:provisionalTaxStartDate>
                                </r6:provisionalTax>
                                <r6:beneficiaryDetails>
                                    <ic:beneficiary>
                                        <ic:beneficiaryIrdNumber>111111111</ic:beneficiaryIrdNumber>
                                        <ic:beneficiaryName>Joe Bloggs</ic:beneficiaryName>
                                        <ic:beneficiaryDOB>1985-09-01</ic:beneficiaryDOB>
                                        <ic:beneficiaryAddress>1 Bloggs Way</ic:beneficiaryAddress>
                                        <ic:beneficiaryIsNonResident>true</ic:beneficiaryIsNonResident>
                                        <ic:shareOfInterestIncome>1000.00</ic:shareOfInterestIncome>
                                        <ic:shareOfDividendsIncome>1000.00</ic:shareOfDividendsIncome>
                                        <ic:shareOfMADistributionsIncome>1000.00</ic:shareOfMADistributionsIncome>
                                        <ic:shareOfOverseasIncome>1000.00</ic:shareOfOverseasIncome>
                                        <ic:shareOfOtherIncome>1000.00</ic:shareOfOtherIncome>
                                        <ic:taxableIncome>5000.00</ic:taxableIncome>
                                        <ic:taxPaidByTrust>true</ic:taxPaidByTrust>
                                        <ic:distributionByNonComplyingtrust>1000.00</ic:distributionByNonComplyingtrust>
                                        <ic:taxOnTaxableIncome>1000.00</ic:taxOnTaxableIncome>
                                        <ic:overseasTaxPaid>500.00</ic:overseasTaxPaid>
                                        <ic:taxLessOverseasTaxPaid>500.00</ic:taxLessOverseasTaxPaid>
                                        <ic:dividendImputationCredit>0</ic:dividendImputationCredit>
                                        <ic:taxLessDividendImputationCredit>500.00</ic:taxLessDividendImputationCredit>
                                        <ic:otherPaidTaxCredits>1000.00</ic:otherPaidTaxCredits>
                                        <ic:taxLessOtherPaidTaxCredits>-500.00</ic:taxLessOtherPaidTaxCredits>
                                        <ic:taxOnDistributionByNonComplyingTrust>450.00</ic:taxOnDistributionByNonComplyingTrust>
                                        <ic:beneficiaryTaxPayable>-50.00</ic:beneficiaryTaxPayable>
                                    </ic:beneficiary>
                                </r6:beneficiaryDetails>
                            </rc:formFields>
                        </rc:fileBody>
                    </r6:fileRequest>
                </fil:FileRequestWrapper>
            </ret:ReturnFileRequestMsg>
        </ret:File>
    </soap:Body>
</soap:Envelope>